Documents/ПереводОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПереводОбучающихся</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальностьКонтингента</xr:Item>
				<xr:Item>AccumulationRegister.ЧисленностьГруппы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Абитуриенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтараяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АктуальностьКонтингента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьКонтингента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специальности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвижениеКонтингента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвижениеКонтингента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЧисленностьГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ЧисленностьГруппы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДвижениеКонтингента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ДвижениеКонтингента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПереводОбучающихся/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаАбитуриенты.ФИО;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Перевод;
	КонецЦикла;
	
	// перевод контингента в новую группу
	МассивУчета = Новый Соответствие;
	
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл 
		Если МассивУчета.Получить(ТекСтрокаАбитуриенты.СтараяГруппа) = 1 Тогда
			МассивУчета[ТекСтрокаАбитуриенты.СтараяГруппа] = МассивУчета[ТекСтрокаАбитуриенты.Группа] + 1;
		Иначе
			МассивУчета.Вставить(ТекСтрокаАбитуриенты.СтараяГруппа, 1);
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЧисленностьГруппы Расход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого Стр Из МассивУчета Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Группа = Стр.Ключ;
		Движение.Количество = Стр.Значение;
	КонецЦикла;
	
	МассивУчета.Очистить();
	
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл 
		Если МассивУчета.Получить(ТекСтрокаАбитуриенты.НоваяГруппа) = 1 Тогда
			МассивУчета[ТекСтрокаАбитуриенты.НоваяГруппа] = МассивУчета[ТекСтрокаАбитуриенты.Группа] + 1;
		Иначе
			МассивУчета.Вставить(ТекСтрокаАбитуриенты.НоваяГруппа, 1);
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЧисленностьГруппы Приход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого Стр Из МассивУчета Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Группа = Стр.Ключ;
		Движение.Количество = Стр.Значение;
	КонецЦикла;
КонецПроцедуры
